Repository: Bodzioss/WSBInvestmentPredictor
Catalog: Frontend/src/Client/WSBInvestmentPredictor.Frontend.Shared/Resources/SharedResource.*.resx
Languages: pl

# AppDescription
source: Intelligent tool for analyzing and predicting investment trends
pl: Inteligentne narzędzie do analizy i przewidywania trendów inwestycyjnych

source: Trend Analysis
pl: Analiza Trendów

# TrendAnalysisDescription
source: Advanced analysis of market and social trends for better investment decisions.
pl: Zaawansowana analiza trendów rynkowych i społecznościowych dla lepszych decyzji inwestycyjnych.

# AIPoweredDescription
source: Utilizing artificial intelligence to predict potential market movements.
pl: Wykorzystanie sztucznej inteligencji do przewidywania potencjalnych ruchów na rynku.

source: Reliable Data
pl: Wiarygodne Dane

# ReliableDataDescription
source: Based on reliable data sources and advanced analytical algorithms.
pl: Bazujemy na wiarygodnych źródłach danych i zaawansowanych algorytmach analitycznych.

source: How to Start?
pl: Jak zacząć?

# HowToStartDescription
source: Select an option from the navigation menu to begin your analysis.
pl: Wybierz interesującą Cię opcję z menu nawigacyjnego, aby rozpocząć analizę.

source: Select company:
pl: Wybierz spółkę

source: Loading...
pl: Ładowanie...

source: Date
pl: Data

source: Error
pl: Błąd

# ThemeStandard
source: Standard
pl: Standardowy

# ThemeDark
source: Dark
pl: Ciemny

# ThemeHumanistic
source: Humanistic
pl: Humanistyczny

# QuickPredictionTitle
source: ⚡️ Quick Company Prediction
pl: ⚡️ Szybka Predykcja Spółki

# LoadingTickers
source: Loading ticker list...
pl: Ładowanie listy spółek...

source: Search company:
pl: Szukaj spółki:

# SearchCompanyPlaceholder
source: e.g. Apple, MSFT, Tesla...
pl: np. Apple, MSFT, Tesla...

# NoMatchingCompanies
source: No matching companies found.
pl: Nie znaleziono pasujących spółek.

source: Number of days:
pl: Liczba dni:

# Days
source: {0} days
pl: {0} dni

source: Calculate prediction
pl: Oblicz predykcję

source: Loading data and generating prediction...
pl: Ładowanie danych i generowanie predykcji...

# NoHistoricalDataAvailable
source: No historical data available for the selected symbol.
pl: Brak danych historycznych dla wybranego symbolu.

# Prediction30DayReturn
source: 30-day return prediction:
pl: Przewidywany zwrot 30-dniowy:

# PredictionTitle
source: 📈 Prediction
pl: 📈 Predykcja

source: Open
pl: Otwarcie

source: High
pl: Najwyższy

source: Low
pl: Najniższy

source: Close
pl: Zamknięcie

source: Volume
pl: Wolumen

source: Predict
pl: Przewiduj

# PredictionResult
source: Prediction (30d return):
pl: Predykcja (zwrot 30d):

# NavigationPredictions
source: Predictions
pl: Predykcje

# NavigationQuickPrediction
source: Quick Prediction
pl: Szybka Predykcja

# NavigationAdvancedPrediction
source: Advanced Prediction
pl: Zaawansowana Predykcja

# NavigationPersonalFinance
source: Personal Finance
pl: Finanse Osobiste

# NavigationExpenses
source: Expenses
pl: Wydatki

# NavigationBudget
source: Budget
pl: Budżet

# NavigationCategories
source: Categories
pl: Kategorie

# NavigationReports
source: Reports
pl: Raporty

# NavigationImportTransactions
source: Import Transactions
pl: Importuj Transakcje

# NavigationTransactions
source: Transactions
pl: Transakcje

source: transactions
pl: transakcji

source: No transactions found
pl: Nie znaleziono transakcji.

source: Counterparty
pl: Kontrahent

source: Title
pl: Tytuł

source: Amount
pl: Kwota

source: Saving...
pl: Zapisywanie...

source: Cancel
pl: Anuluj

# ImportTransactionsHelpTitle
source: Import Transactions Help
pl: Pomoc - Import Transakcji

# ImportTransactionsHelpContent
source: This dialog allows you to import bank transactions from CSV files. **How to use:** 1. Click "Choose File" to select your bank statement CSV file 2. The system will automatically process and display a preview of the transactions 3. Review the transactions in the table below 4. Click "Save Transactions" to import them into the system 5. After import, category rules will be automatically applied to categorize the transactions **Supported formats:** - CSV files from most major banks - Files should contain columns for date, amount, description, and account information **What happens after import:** - All transactions are saved to the database - Category rules are automatically applied to categorize transactions - You can view and edit transactions on the main transactions page - The pie chart will update to show spending by category
pl: To okno pozwala na import transakcji bankowych z plików CSV. **Jak używać:** 1. Kliknij "Wybierz plik" aby wybrać plik CSV z wyciągiem bankowym 2. System automatycznie przetworzy i wyświetli podgląd transakcji 3. Przejrzyj transakcje w tabeli poniżej 4. Kliknij "Zapisz transakcje" aby zaimportować je do systemu 5. Po imporcie reguły kategorii zostaną automatycznie zastosowane **Obsługiwane formaty:** - Pliki CSV z większości głównych banków - Pliki powinny zawierać kolumny z datą, kwotą, opisem i informacjami o koncie **Co dzieje się po imporcie:** - Wszystkie transakcje są zapisywane w bazie danych - Reguły kategorii są automatycznie stosowane do kategoryzacji transakcji - Możesz przeglądać i edytować transakcje na głównej stronie transakcji - Wykres kołowy zaktualizuje się pokazując wydatki według kategorii

source: Categories Configuration
pl: Konfiguracja Kategorii

source: Category
pl: Kategoria

source: Actions
pl: Akcje

source: Edit
pl: Edytuj

source: Delete
pl: Usuń

source: Save Changes
pl: Zapisz Zmiany

source: Add Category
pl: Dodaj Kategorię

source: Add
pl: Dodaj

source: Rules
pl: Reguły

source: Error loading data
pl: Błąd podczas ładowania danych

source: Apply Rules
pl: Zastosuj reguły

source: Success
pl: Sukces

source: Rules applied successfully
pl: Reguły zostały zastosowane pomyślnie

source: Error applying rules
pl: Błąd podczas stosowania reguł

source: Categorize Transactions
pl: Kategoryzuj transakcje

# NoUncategorizedTransactions
source: No uncategorized transactions found
pl: Nie znaleziono niezakategoryzowanych transakcji

source: Select Category
pl: Wybierz kategorię

source: Add Rule
pl: Dodaj regułę

source: Description
pl: Opis

source: Error saving rule
pl: Błąd podczas zapisywania reguły

source: Error deleting rule
pl: Błąd podczas usuwania reguły

source: Edit Rule
pl: Edytuj regułę

# FieldIsRequired
source: This field is required
pl: To pole jest wymagane

# CategoryNameTooLong
source: Category name cannot be longer than 100 characters
pl: Nazwa kategorii nie może być dłuższa niż 100 znaków

# CategoryDescriptionTooLong
source: Description cannot be longer than 500 characters
pl: Opis nie może być dłuższy niż 500 znaków

# KeywordTooLong
source: Keyword cannot be longer than 200 characters
pl: Słowo kluczowe nie może być dłuższe niż 200 znaków

source: Category is required
pl: Kategoria jest wymagana

# YouMustSelectCategory
source: You must select a category
pl: Musisz wybrać kategorię

source: Category Analysis
pl: Analiza kategorii

# NoDataForAnalysis
source: No data available for analysis
pl: Brak danych do analizy

source: Field Type
pl: Typ pola

# FieldTypeTitle
source: Transaction Title
pl: Tytuł transakcji

# FieldTypeCounterparty
source: Transaction Counterparty
pl: Odbiorca transakcji

source: Select field type
pl: Wybierz typ pola

source: Back to Categories
pl: Powrót do kategorii

# SelectCategoryToViewRules
source: Please select a category to view its rules
pl: Wybierz kategorię, aby zobaczyć jej reguły

# CreateRuleForKeyword
source: Create a rule for keyword
pl: Utwórz regułę dla słowa kluczowego

source: Categories
pl: Kategorie

source: Category added successfully
pl: Kategoria została dodana pomyślnie

source: Rule added successfully
pl: Reguła została dodana pomyślnie

source: Rule updated successfully
pl: Reguła została zaktualizowana pomyślnie

source: Rule deleted successfully
pl: Reguła została usunięta pomyślnie

source: Help
pl: Pomoc

# CategoriesHelpTitle
source: Categories - Help
pl: Kategorie - Pomoc

source: What are Categories?
pl: Czym są kategorie?

# CategoriesExplanation
source: Categories help you organize your transactions by grouping similar expenses together. For example, you might have categories like "Groceries", "Transportation", "Entertainment", etc. This makes it easier to track your spending patterns and create reports.
pl: Kategorie pomagają organizować transakcje poprzez grupowanie podobnych wydatków. Na przykład możesz mieć kategorie takie jak "Żywność", "Transport", "Rozrywka" itp. To ułatwia śledzenie wzorców wydatków i tworzenie raportów.

source: How to use Categories
pl: Jak używać kategorii

# AddCategoryHelp
source: Click the "Add Category" button to create a new category. Enter a name and optional description.
pl: Kliknij przycisk "Dodaj kategorię" aby utworzyć nową kategorię. Wprowadź nazwę i opcjonalny opis.

# EditCategoryHelp
source: Click the pencil icon to edit a category's name or description.
pl: Kliknij ikonę ołówka aby edytować nazwę lub opis kategorii.

# RulesHelp
source: Click the gear icon to manage categorization rules for this category. Rules automatically assign transactions to categories based on keywords.
pl: Kliknij ikonę koła zębatego aby zarządzać regułami kategoryzacji dla tej kategorii. Reguły automatycznie przypisują transakcje do kategorii na podstawie słów kluczowych.

# DeleteCategoryHelp
source: Click the trash icon to delete a category. This will also delete all associated rules.
pl: Kliknij ikonę kosza aby usunąć kategorię. To również usunie wszystkie powiązane reguły.

source: Tips
pl: Wskazówki

# CategoryTips1
source: Use clear, descriptive names for your categories to make them easy to identify.
pl: Używaj jasnych, opisowych nazw dla kategorii aby były łatwe do identyfikacji.

# CategoryTips2
source: Create rules for each category to automatically categorize your transactions.
pl: Twórz reguły dla każdej kategorii aby automatycznie kategoryzować transakcje.

# CategoryTips3
source: You can edit categories at any time, but be careful when deleting them as this will affect existing transactions.
pl: Możesz edytować kategorie w dowolnym momencie, ale bądź ostrożny przy ich usuwaniu, ponieważ wpłynie to na istniejące transakcje.

source: Got it!
pl: Rozumiem!

# RulesHelpTitle
source: Category Rules - Help
pl: Reguły kategorii - Pomoc

# WhatAreRules
source: What are Category Rules?
pl: Czym są reguły kategorii?

# RulesExplanation
source: Category rules automatically assign transactions to categories based on keywords found in transaction data. Rules are applied immediately when you add, edit, or delete them, as well as when new transactions are imported. This saves you time by eliminating the need to manually categorize each transaction.
pl: Reguły kategorii automatycznie przypisują transakcje do kategorii na podstawie słów kluczowych znalezionych w danych transakcji. Reguły są stosowane natychmiast gdy je dodajesz, edytujesz lub usuwasz, a także gdy importowane są nowe transakcje. To oszczędza czas eliminując potrzebę ręcznego kategoryzowania każdej transakcji.

# HowRulesWork
source: How do Rules Work?
pl: Jak działają reguły?

# RulesWorkExplanation
source: Rules are applied automatically in real-time. When you create or modify a rule, the system immediately scans all transactions and looks for the specified keywords in the selected field. If a match is found, the transaction is automatically assigned to the category. New transactions are also automatically categorized when imported.
pl: Reguły są stosowane automatycznie w czasie rzeczywistym. Gdy tworzysz lub modyfikujesz regułę, system natychmiast skanuje wszystkie transakcje i szuka określonych słów kluczowych w wybranym polu. Jeśli znajdzie dopasowanie, transakcja jest automatycznie przypisana do kategorii. Nowe transakcje są również automatycznie kategoryzowane podczas importu.

source: Field Types
pl: Typy pól

# FieldTypeTitleHelp
source: Search for keywords in the transaction title/description field.
pl: Szukaj słów kluczowych w polu tytułu/opisu transakcji.

# FieldTypeCounterpartyHelp
source: Search for keywords in the counterparty/merchant name field.
pl: Szukaj słów kluczowych w polu nazwy odbiorcy/sklepu.

source: How to use Rules
pl: Jak używać reguł

# AddRuleHelp
source: Click "Add Rule" to create a new rule. Enter a keyword and select which field to search in.
pl: Kliknij "Dodaj regułę" aby utworzyć nową regułę. Wprowadź słowo kluczowe i wybierz w którym polu szukać.

# EditRuleHelp
source: Click the pencil icon to modify an existing rule's keyword or field type.
pl: Kliknij ikonę ołówka aby zmodyfikować słowo kluczowe lub typ pola istniejącej reguły.

# DeleteRuleHelp
source: Click the trash icon to remove a rule. This will stop automatic categorization for that keyword.
pl: Kliknij ikonę kosza aby usunąć regułę. To zatrzyma automatyczną kategoryzację dla tego słowa kluczowego.

# RuleTips1
source: Use specific keywords that are unique to the category to avoid false matches.
pl: Używaj konkretnych słów kluczowych, które są unikalne dla kategorii aby uniknąć błędnych dopasowań.

# RuleTips2
source: Test your rules by applying them and checking if transactions are categorized correctly.
pl: Testuj swoje reguły stosując je i sprawdzając czy transakcje są kategoryzowane poprawnie.

# RuleTips3
source: You can have multiple rules for the same category to catch different variations of transaction descriptions.
pl: Możesz mieć wiele reguł dla tej samej kategorii aby złapać różne warianty opisów transakcji.

# RuleAddedAndAppliedSuccessfully
source: Rule added successfully and applied to all matching transactions
pl: Reguła została dodana pomyślnie i zastosowana do wszystkich pasujących transakcji

# RuleUpdatedAndAppliedSuccessfully
source: Rule updated successfully and applied to all matching transactions
pl: Reguła została zaktualizowana pomyślnie i zastosowana do wszystkich pasujących transakcji

# RuleDeletedAndAppliedSuccessfully
source: Rule deleted successfully and remaining rules applied to all transactions
pl: Reguła została usunięta pomyślnie i pozostałe reguły zostały zastosowane do wszystkich transakcji

# TransactionsHelpTitle
source: Transactions Page Help
pl: Pomoc - Strona Transakcji

# TransactionsHelpContent
source: This page allows you to view, filter, and manage your bank transactions.
pl: Ta strona pozwala przeglądać, filtrować i zarządzać Twoimi transakcjami bankowymi. **Główne funkcje:** - Przeglądaj wszystkie zaimportowane transakcje w przeszukiwalnej i sortowalnej tabeli - Filtrowanie transakcji po kategorii za pomocą wykresu kołowego lub przycisków - Importuj nowe transakcje przyciskiem "Importuj transakcje" (pliki CSV) - Edytuj pojedyncze transakcje - Zobacz wykres kołowy wydatków według kategorii (tylko wydatki) - Wszystkie importowane transakcje są automatycznie kategoryzowane według Twoich reguł **Jak używać:** 1. Użyj wykresu kołowego, aby filtrować po kategorii lub kliknij "Wyczyść filtr", aby zobaczyć wszystkie 2. Kliknij "Importuj transakcje", aby dodać nowe transakcje z wyciągu bankowego 3. Użyj ikony ołówka, aby edytować transakcję 4. Dodawaj lub edytuj reguły kategorii w sekcji konfiguracji, aby poprawić automatyczną kategoryzację **Wskazówki:** - Na wykresie kołowym widoczne są tylko wydatki (kwoty ujemne) - Po imporcie reguły są stosowane automatycznie, a wykres się aktualizuje - Możesz zawsze ponownie zaimportować lub edytować transakcje według potrzeb

# TransactionsHelpDescription
source: This page allows you to view, filter, and manage your bank transactions.
pl: Ta strona pozwala przeglądać, filtrować i zarządzać Twoimi transakcjami bankowymi.

# TransactionsHelpMainFeatures
source: Main features:
pl: Główne funkcje:

# TransactionsHelpMainFeature1
source: Browse all imported transactions in a searchable and sortable table
pl: Przeglądaj wszystkie zaimportowane transakcje w przeszukiwalnej i sortowalnej tabeli

# TransactionsHelpMainFeature2
source: Filter transactions by category using the pie chart or buttons
pl: Filtrowanie transakcji po kategorii za pomocą wykresu kołowego lub przycisków

# TransactionsHelpMainFeature3
source: Import new transactions using the "Import Transactions" button (CSV files)
pl: Importuj nowe transakcje przyciskiem "Importuj transakcje" (pliki CSV)

# TransactionsHelpMainFeature4
source: Edit individual transactions
pl: Edytuj pojedyncze transakcje

# TransactionsHelpMainFeature5
source: See a pie chart of expenses by category (expenses only)
pl: Zobacz wykres kołowy wydatków według kategorii (tylko wydatki)

# TransactionsHelpMainFeature6
source: All imported transactions are automatically categorized according to your rules
pl: Wszystkie importowane transakcje są automatycznie kategoryzowane według Twoich reguł

# TransactionsHelpHowTo
source: How to use:
pl: Jak używać:

# TransactionsHelpHowTo1
source: Use the pie chart to filter by category or click "Clear Filter" to see all
pl: Użyj wykresu kołowego, aby filtrować po kategorii lub kliknij "Wyczyść filtr", aby zobaczyć wszystkie

# TransactionsHelpHowTo2
source: Click "Import Transactions" to add new transactions from a bank statement
pl: Kliknij "Importuj transakcje", aby dodać nowe transakcje z wyciągu bankowego

# TransactionsHelpHowTo3
source: Use the pencil icon to edit a transaction
pl: Użyj ikony ołówka, aby edytować transakcję

# TransactionsHelpHowTo4
source: Add or edit category rules in the configuration section to improve automatic categorization
pl: Dodawaj lub edytuj reguły kategorii w sekcji konfiguracji, aby poprawić automatyczną kategoryzację

# TransactionsHelpTips
source: Tips:
pl: Wskazówki:

# TransactionsHelpTip1
source: Only expenses (negative amounts) are visible on the pie chart
pl: Na wykresie kołowym widoczne są tylko wydatki (kwoty ujemne)

# TransactionsHelpTip2
source: After import, rules are applied automatically and the chart updates
pl: Po imporcie reguły są stosowane automatycznie, a wykres się aktualizuje

# TransactionsHelpTip3
source: You can always re-import or edit transactions as needed
pl: Możesz zawsze ponownie zaimportować lub edytować transakcje według potrzeb

# TransactionsHelpGotIt
source: Got it!
pl: Rozumiem

# ExpensesAnalysisTitle
source: Expenses Analysis (Outflows Only)
pl: Analiza Wydatków (Tylko Wypływy)

source: Summary
pl: Podsumowanie

source: Total Expenses
pl: Łączne Wydatki

source: Total Transactions
pl: Łączna Liczba Transakcji

source: Categorized
pl: Zakategoryzowane

source: Uncategorized
pl: Niezakategoryzowane

# NoExpenseDataAvailable
source: No expense data available for analysis
pl: Brak danych o wydatkach do analizy

source: Technologies Used
pl: Używane Technologie

source: Prediction Model
pl: Model Predykcyjny

# PredictionModelDescription
source: Advanced machine learning model for stock market prediction using sentiment analysis from Reddit's WallStreetBets community.
pl: Zaawansowany model uczenia maszynowego do przewidywania rynku akcji wykorzystujący analizę sentymentu z społeczności Reddit WallStreetBets.

# PredictionFeature1
source: Real-time sentiment analysis from Reddit
pl: Analiza sentymentu w czasie rzeczywistym z Reddit

# PredictionFeature2
source: Machine learning-based stock predictions
pl: Przewidywania akcji oparte na uczeniu maszynowym

# PredictionFeature3
source: Backtesting capabilities for strategy validation
pl: Możliwości backtestingu do walidacji strategii

# PredictionFeature4
source: Market data integration and analysis
pl: Integracja i analiza danych rynkowych

source: Explore Prediction
pl: Eksploruj Predykcje

# ExpensesDescription
source: Comprehensive personal finance management system for tracking and categorizing bank transactions.
pl: Kompleksowy system zarządzania finansami osobistymi do śledzenia i kategoryzowania transakcji bankowych.

# ExpensesFeature1
source: CSV import from bank statements
pl: Import CSV z wyciągów bankowych

# ExpensesFeature2
source: Automatic transaction categorization
pl: Automatyczna kategoryzacja transakcji

# ExpensesFeature3
source: Custom category rules and management
pl: Niestandardowe reguły i zarządzanie kategoriami

# ExpensesFeature4
source: Visual spending analysis with charts
pl: Wizualna analiza wydatków z wykresami

source: Manage Expenses
pl: Zarządzaj Wydatkami

source: All Transactions
pl: Wszystkie transakcje

source: Import Transactions
pl: Importuj transakcje

source: Add Sample Data
pl: Dodaj przykładowe dane

source: Clear All Transactions
pl: Usuń wszystkie transakcje

source: Clear Filter
pl: Wyczyść filtr

source: Loading transactions...
pl: Ładowanie transakcji...
